# 待完成功能

## 笔记模块

- [x] 重命名笔记
- [x] 删除笔记
- [x] 编辑视图模式（常规模式、编辑模式、预览、沉浸模式）
- [x] 笔记添加描述
- [x] markdown 编辑视图、预览视图同步
- [x] 搜索功能
- [ ] redux-persist
- [ ] 笔记标签
- [ ] 笔记导出pdf，长图

## 云同步

- [x] OneDriver 上传下载

## 路由

- [ ] About页面

## 废纸篓
- [x] 删除笔记本列表
- [x] 删除笔记列表
- [x] 永久删除笔记本
- [x] 永久删除笔记
- [x] 还原项目
- [x] 还原笔记

## 打包
- [x] Mac OS
- [ ] Linux
- [ ] Windows
- [ ] 体积压缩

## 美工

- [x] LOGO修改

## 主页

- [ ] github page

## 仓库

- [ ] 建立github仓库
- [ ] 软件版本

## 更新

- [ ] 版本更新提示
- [ ] 热更新

## 后序迭代

- [ ] 图床模块
- [ ] 最新编辑时间